import psycopg2
import random

# Замените следующие параметры подключения вашими данными
db_params = {
  "host": "localhost",
  "database": "ict",
  "user": "ictuser",
  "password": "qwerty90"
}

names = [
  "Иван", "София", "Максим", "Анастасия", "Александр", "Мария", "Дмитрий", "Алиса", "Кирилл", "Екатерина", "Артем", "Полина", "Илья", "Евгения", "Андрей", "Виктория", "Михаил", "Анна", "Никита", "Елена", "Денис", "Юлия", "Алексей", "Ольга", "Константин", "Людмила", "Артур", "Надежда", "Павел", "Алина", "Сергей", "Евгений", "Георгия", "Татьяна", "Владимир", "Елизавета", "Роман", "Арина", "Василий", "Ангелина", "Глеб", "Карина", "Вадим", "Вероника", "Станислав", "Валентина", "Антон", "Маргарита", "Даниил", "Наталья", "Игорь", "Оксана", "Арсений", "Есения", "Федор", "Ирина", "Семен", "Милана", "Антонина", "Алекс", "Алла", "Владислав", "Лариса", "Валентин", "Лидия", "Григорий", "Галина", "Степан", "Светлана", "Филипп", "Евдокия", "Аркадий", "Эвелина", "Матвей", "Юлиана", "Эдуард", "Руслана", "Макар", "Сабина", "Анатолий", "Валерия", "Валентин", "Елисавета", "Спартак", "Альбина", "Давид", "Динара", "Кирилла", "Людвиг", "Гертруда", "Герман", "Эльвира", "Давлат", "Анжелика", "Рустам", "Алёна", "Ахмет", "Алисия"
]

surnames = [
  "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Федоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев", "Григорьев", "Романов", "Воробьев", "Медведев", "Антонов", "Леонов", "Гаврилов", "Гусев", "Козлов", "Ильин", "Потапов", "Сергеев", "Максимов", "Филиппов", "Кудрявцев", "Беляков", "Кирсанов", "Селезнев", "Александров", "Буров", "Воронов", "Лазарев", "Калинин", "Киреев", "Исаев", "Щербаков", "Бирюков", "Горбунов", "Баранов", "Тимофеев", "Горбачев", "Гришин", "Кошелев", "Давыдов", "Марков", "Юдин", "Кудряшов", "Миронов", "Мясников", "Ларин", "Колесников", "Тихонов", "Кулагин", "Мельников", "Данилов", "Ефимов", "Афанасьев", "Левшин", "Скворцов", "Гордеев", "Чернов", "Анисимов", "Королев", "Быков", "Кондратьев", "Горшков", "Марков", "Архипов", "Краснов", "Ковалев", "Пестов", "Кудинов", "Беспалов", "Барсуков", "Парфенов", "Максимов", "Тарасов", "Щербаков", "Булгаков", "Сысоев"
]

course_names = ["Математика", "История Мира", "Физика для начинающих", "Литературное искусство", "Биология в действии", "Основы программирования", "Химические реакции", "Иностранные языки", "Искусство и культура", "Основы экономики"]

try:
  # Установка соединения с базой данных
  conn = psycopg2.connect(**db_params)
  cursor = conn.cursor()

  # SQL-запрос для вставки данных о студенте
  insert_query = """
  INSERT INTO Students (first_name, last_name, age, course_name, average_score)
  VALUES (%(first_name)s, %(last_name)s, %(age)s, %(course_name)s, %(average_score)s);
  """

  # Выполнение SQL-запроса
  for i in range(1000):
    # Данные студента
    cursor.execute(insert_query, {
      "first_name": random.choice(names),
      "last_name": random.choice(surnames),
      "age": random.randint(17, 20),
      "course_name": random.choice(course_names),
      "average_score": ((random.random()*3 + 1) * 100 // 1) / 100
    })
  
  # Фиксация изменений
  conn.commit()
  
  print("Данные студента успешно вставлены в таблицу Students.")
    
except (Exception, psycopg2.DatabaseError) as error:
  print("Ошибка при вставке данных:", error)

finally:
  # Закрытие соединения
  if conn:
    conn.close()
